import { Course } from "../types/Course";

export const courses: Course[] = [
  {
    title: "Урок 1. Вступ до японської мови",
    videoUrl: "https://www.youtube.com/embed/lcTk2bFtaVw?si=1bVxowqOwILyqyjt",
    description: `<div>
											<h2 class='mb-2'>В цьому уроці ви дізнаєтесь:</h2>
											<ul class=''>
													<li>- які особливості японської та чим вона відрізняється від інших мов</li>
													<li>- коротку історію японського письма</li>
													<li>- що таке японські абетки хіраґана та катакана</li>
													<li>- що таке японські ієрогліфи - канджі</li>
													<li>- перші базові фрази та слова</li>
													<li>- та багато іншого!</li>
											</ul>
									</div>`,
  },
  {
    title: "Урок 2. Структура письма. Японська абетка",
    videoUrl: "https://www.youtube.com/embed/gUWR0ya0Ey0?si=YcEoxZzhM3C_cJo1",
    description: `<div>
											<h2 class='mb-2'>В цьому уроці ви дізнаєтесь:</h2>
											<ul class=''>
													<li>- як утворились японські абетки</li>
													<li>- для чого їх використовують</li>
													<li>- як поєднуються абетки та ієрогліфи на письм</li>
													<li>- звідки в Японії ієрогліфи і чому їх називають канджі</li>
													<li>- як правильно записувати абетки та канджі</li>
													<li>- чому у канджі декілька читань</li>
													<li>- та звісно нові слова та вирази</li>
											</ul>
									</div>`,
  },
  {
    title: "Урок 3. Структура письма. Нюанси кани",
    videoUrl: "https://www.youtube.com/embed/ZHYFQ3Pbh-k?si=RjA8IiiyzhqHqbXG",
    description: `<div>
											<h2 class='mb-2'>В цьому уроці ви дізнаєтесь:</h2>
											<ul class=''>
													<li>- як виразити на письмі звуки, яких немає в кані</li>
													<li>- що таке одзвінчення</li>
													<li>- що таке оглушення</li>
													<li>- як подвоїти приголосні</li>
													<li>- як утворити дифтонги (подовжені голосні)</li>
													<li>- як читати м'які звуки</li>
													<li>- та звісно нові слова та вирази</li>
													<li>- а також бонус! невеликий список українських імен японською!</li>
											</ul>
									</div>`,
  },
  {
    title: "Урок 4. Будова речення. Частки",
    videoUrl: "https://www.youtube.com/embed/QppYJMosCmI?si=GEsOOJXg1xEgcUp8",
    description: `<div>
											<h2 class='mb-2'>В цьому уроці ви дізнаєтесь:</h2>
											<ul class=''>
													<li>- які частини мови притаманні японській</li>
													<li>- чим вони відрізняються від українських</li>
													<li>- що таке です (дес) і як його вживати</li>
													<li>- як використовувати частки は (ва) і が (ґа)</li>
													<li>- японські безособові займенники - косоадо</li>
													<li>- "це", "те", "он те" японською</li>
													<li>- як сказати "цей", "той" японською</li>
											</ul>
									</div>`,
  },
  {
    title: "Урок 5. Граматичні частки も、と、の、を",
    videoUrl: "https://www.youtube.com/embed/O6Yn1b9pbZw?si=oGtdY_fZSG9lQ-J_",
    description: `<div>
											<h2 class='mb-2'>В цьому уроці ви дізнаєтесь:</h2>
											<ul class=''>
													<li>- що означають та як вживаються частки も、と、の、を</li>
													<li>- як вживати частку の з дієсловами</li>
													<li>- часто вживані "домашні" вирази</li>
													<li>- а також добряче попрактикуєтесь ;)</li>
											</ul>
									</div>`,
  },
];
